Testing Docs Patterns/FIRST_TEST-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: FIRST TEST-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: FIRST TEST-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  FIRST TEST-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1536,721)
      - go(https://chrome.google.com/webstore/detail/blazemeter-the-continuous/mbopgmdnpcbohhpnfglgohlbhfongabi/related?hl=en)
      - switchWindow(win_ser_1)
      - go(https://www.similarweb.com/)
      - clickByCSS(button.pushcrew-chrome-style-notification-btn.pushcrew-btn-close)

  FIRST TEST-Http:
    headers:
      sec-ch-ua: '" Not;A Brand";v="99", "Google Chrome";v="91", "Chromium";v="91"'
      sec-ch-ua-mobile: '?0'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://www.similarweb.com/'
            method: GET
            label: 'https://www.similarweb.com/'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
          - url: 'https://www.similarweb.com/api/corp/notifications'
            method: GET
            label: 'https://www.similarweb.com/api/corp/notifications'
            headers:
              Content-Type: application/json; charset=utf-8
              Accept: '*/*'
          - url: 'https://stats.g.doubleclick.net/j/collect?t=dc&aip=1&_r=3&v=1&_v=j91&tid=UA-42469261-1&cid=1591635129.1625864395&jid=276480120&gjid=1763092317&_gid=1740064159.1625864395&_u=KGBAgEAjAAAAAE~&z=1362066512'
            method: POST
            label: 'https://stats.g.doubleclick.net/j/collect?t=dc&aip=1&_r=3&v=1&_v=j91&tid=UA-42469261-1&cid=1591635129.1625864395&jid=276480120&gjid=1763092317&_gid=1740064159.1625864395&_u=KGBAgEAjAAAAAE~&z=1362066512'
            headers:
              Content-Type: text/plain
              Accept: '*/*'
          - url: 'https://collector-pxkz1aizup.px-cloud.net/api/v2/collector'
            method: POST
            label: 'https://collector-pxkz1aizup.px-cloud.net/api/v2/collector'
            headers:
              Content-type: application/x-www-form-urlencoded
              Accept: '*/*'
            body:
              appId: PXkZ1aIzUP
              en: NTA
              ft: '221'
              payload: aUkQRhAIEGJqABAeEFYQCEkQYmoLBBAIEFpGRkJBCB0dRUVFHEFbX1teU0BFV1AcUV1fHRAeEGJqBAEQCBBlW1wBABAeEGJqAwsDEAgCHhBiagoHAhAIAh4QYmoKBwMQCAEBCgEeEGJqAwICChAIAQQCAh4QYmoDAgcHEAgDBAAHCgQGAQsHAwAEHhBiagMCBwQQCAMEAAcKBAYBCwcDAQUeEGJqAwIBChAIEAtRUFMAUQMCH1cCVAofAwNXUB8LBFdQH1YHAFdUUQBWCgtQBBAeEGJqAQUDEAhGQEdXT09v
              pc: '7711009755172909'
              rsc: '1'
              seq: '0'
              tag: v6.7.9
              uuid: 9cba2c10-e0f8-11eb-96eb-d52efc2d89b6
          - url: 'https://mpp.similarweb.com/track/'
            method: GET
            label: 'https://mpp.similarweb.com/track/'
            headers:
              Accept: '*/*'
            body:
              data: eyJldmVudCI6ICJQYWdlVmlldyIsInByb3BlcnRpZXMiOiB7IiRvcyI6ICJXaW5kb3dzIiwiJGJyb3dzZXIiOiAiQ2hyb21lIiwiJHJlZmVycmVyIjogImh0dHBzOi8vY2hyb21lLmdvb2dsZS5jb20vIiwiJHJlZmVycmluZ19kb21haW4iOiAiY2hyb21lLmdvb2dsZS5jb20iLCIkY3VycmVudF91cmwiOiAiaHR0cHM6Ly93d3cuc2ltaWxhcndlYi5jb20vIiwiJGJyb3dzZXJfdmVyc2lvbiI6IDkxLCIkc2NyZWVuX2hlaWdodCI6IDg2NCwiJHNjcmVlbl93aWR0aCI6IDE1MzYsIm1wX2xpYiI6ICJ3ZWIiLCIkbGliX3ZlcnNpb24iOiAiMi40MS4wIiwiJGluc2VydF9pZCI6ICI3dWxlanZsMGJnMW8wYjg0IiwidGltZSI6IDE2MjU4NjQzOTUuMjc5LCJkaXN0aW5jdF9pZCI6ICIxN2E4ZDExZDlmMDMtMDljNThlZDFiMDdhN2UtNjM3MzI2NC0xNDQwMDAtMTdhOGQxMWQ5ZjEyZGYiLCIkZGV2aWNlX2lkIjogIjE3YThkMTFkOWYwMy0wOWM1OGVkMWIwN2E3ZS02MzczMjY0LTE0NDAwMC0xN2E4ZDExZDlmMTJkZiIsInNnSWQiOiAiYzgwMzVjNmItM2Q0Yy02NDJhLWQ2YzgtNmM0N2UyNTRmMzA4Iiwic2l0ZV90eXBlIjogImNvcnAiLCIkc2VhcmNoX2VuZ2luZSI6ICJnb29nbGUiLCIkaW5pdGlhbF9yZWZlcnJlciI6ICJodHRwczovL2Nocm9tZS5nb29nbGUuY29tLyIsIiRpbml0aWFsX3JlZmVycmluZ19kb21haW4iOiAiY2hyb21lLmdvb2dsZS5jb20iLCJzZXNzaW9uX2lkIjogIjNmNTdmZDg3LTQ1MjItNDdjNS04MGEzLWY0YzA3YmRkMzZlNSIsInNlc3Npb25fZmlyc3RfZXZlbnRfdGltZSI6IHt9LCJ1cmwiOiAiaHR0cHM6Ly93d3cuc2ltaWxhcndlYi5jb20vIiwiaXNfc3dfdXNlciI6IGZhbHNlLCJsYW5ndWFnZSI6ICJlbiIsInNlY3Rpb24iOiAiaG9tZSIsInN1Yl9zZWN0aW9uIjogInBhZ2UiLCJzdWJfc3ViX3NlY3Rpb24iOiAiIiwiZmlyc3RfdGltZV92aXNpdG9yIjogdHJ1ZSwibGFzdF9ldmVudF90aW1lIjogMTYyNTg2NDM5NTI3NSwidG9rZW4iOiAiN2NjYjg2ZjVjMjkzOTAyNmE0YjVkZTgzYjU5NzFlZDkifX0=
              ip: '1'
              _: '1625864395282'
          - url: 'https://c.statcounter.com/t.php'
            method: GET
            label: 'https://c.statcounter.com/t.php'
            headers:
              Accept: '*/*'
            body:
              sc_project: '8617147'
              u1: A7C1DB2A507A4FA07DFAD325A547A19D
              java: '1'
              security: 12c4f67d
              sc_snum: '1'
              sess: 8987a3
              p: '0'
              rcat: o
              rdom: google
              rdomg: new
              bb: '1'
              jg: new
              rr: 1.1.1.1.1.1.1.1.1
              resolution: '1536'
              h: '864'
              camefrom: 'https://chrome.google.com/'
              u: 'https://www.similarweb.com/'
              t: 'Website Traffic - Check and Analyze Any Website | Similarweb'
              invisible: '1'
              sc_rum_e_s: '3800'
              sc_rum_e_e: '3812'
              sc_rum_f_s: '0'
              sc_rum_f_e: '3432'
              get_config: 'true'
          - url: 'https://tracking.chilipiper.com/mp/track'
            method: POST
            label: 'https://tracking.chilipiper.com/mp/track'
            headers:
              Accept: application/json
              Content-Type: application/json
            body: '{"name":"Loaded Book Meeting page","data":{"token":"ea72ea55bd8becedff71db6556046406","userId":"similarweb.com","hasFormInPage":true,"isPageLoaded":false}}'
          - url: 'https://collector-pxkz1aizup.px-cloud.net/api/v2/collector'
            method: POST
            label: 'https://collector-pxkz1aizup.px-cloud.net/api/v2/collector'
            headers:
              Content-type: application/x-www-form-urlencoded
              Accept: '*/*'
            body:
              payload: aUkQRhAIEGJqARAeEFYQCEkQYmoAAQYQCFRTXkFXHhBiagABBxAIVFNeQVceEGJqAwcDEAhUU15BVx4QYmoAAQsQCFRTXkFXHhBiagAGAhAIVFNeQVceEGJqAwcAEAhUU15BVx4QYmoDBwEQCFRTXkFXHhBiagEDBhAIVFNeQVceEGJqAwsAEAhUU15BVx4QYmoDCwQQCFRTXkFXHhBiagACBRAIVFNeQVceEGJqAAcDEAhUU15BVx4QYmoLCgAQCAMEAAcKBAYBCwQKBwEeEGJqCwoBEAgQAwYBBwQLBgADAwEBAgIEAgEKBQMQHhAGAwQCAQ4DBQYGBAQHBwEHBA8ABhAIEAcCBQMADwIEBwcFBQYGAAYFDgEHEB4QYmoLCgcQCAcKBQMeEGJqAwIBARAIEFcCV1NUAwJXEB4QYmoDAgMLEAgQVgMLAwVRUwYQHhBiagMCAAIQCBAFBQQEUwcAVhAeEGJqAwIAAxAIEAMKAlZWBVcBEB4QYmoDAgAAEAgQBFMLAgEFClYQHhBiagMCAQcQCEZAR1ceEGJqAwMBCxAIVFNeQVceEGJqAwIABxAIVFNeQVceEGJqAQcLEAgQBVYGA1cKAgoEAQdWUwoABAJQBAoKAVYCUAAFBwVRA1MQHhBiagsGARAIEFEBWVBaWAJbX10BCwRAB1BaCkNVEB4QYmoBBwUQCBAHVgNTBFBWBlAKB1MLCwdQBVQCCgdUAAFRUwAAAlQHBxAeEGJqAQcKEAgQCwAGUQdQVlQGAVBWBlEAAQYFC1MGVwcFAlMLBgMBBgYQHhBiagAACxAIAAYeEGJqAAECEAgABh4QYmoLAxAIAwcBBB4QYmoLABAICgQGHhBiagAECxAIAwcBBB4QYmoABQIQCAoABh4QYmoLARAIEAMHAQRqCgQGEB4QYmoDCgcQCAUAAB4QYmoDCgQQCAMHAQQeEGJqAwoFEAgCHhBiagMKChAIAh4QYmoLBxAIRkBHVx4QYmoGAgIQCAsFAh4QYmoGAgYQCBADBgZOBwZOBwZOAwoCTgQKEB4QYmoLAhAIaRBeXVNWZltfV0EQHhBRQVsQHhBTQkIQHhBAR1xGW19XEG8eEGJqAwsCEAgQEB4QYmoHBwAQCBBUU15BVxAeEGJqAQsLEAgQVFNeQVcQHhBiagcGCxAIAx4QYmoGAwMQCAMeEGJqBgIHEAhGQEdXHhBiagcGBRAIRkBHVx4QYmoDAQYQCEZAR1ceEGJqCgsQCEZAR1ceEGJqAwUCEAgBHhBiagoHEAhpEHFaQF1fVxJidnQSYl5HVVtcEB4QcVpAXV9XEmJ2dBJkW1dFV0AQHhB8U0ZbRFcScV5bV1xGEG8eEGJqAwMFCxAIRkBHVx4QYmoDAwoCEAhGQEdXHhBiagcLEAgQf11IW15eUx0HHAISGmVbXFZdRUESfGYSAwIcAgkSZVtcBAYJEkoEBhsSc0JCXldlV1B5W0YdBwEFHAEEEhp5emZ/fh4SXltZVxJ1V1FZXRsScVpAXV9XHQsDHAIcBgYFABwDAAYSYVNUU0BbHQcBBRwBBBAeEGJqBAMQCBBXXBAeEGJqAQMBEAhpEFdcEB4QV1wfZ2EQbx4QYmoEARAIEGVbXAEAEB4QYmoKBBAIRkBHVx4QYmoDBwYQCB8DCgIeEGJqAwMHBRAICh4QYmoDAwUBEAgAHhBiagMBARAIRkBHVx4QYmoKChAIRkBHVx4QYmoDBAsQCAYeEGJqBAAQCBB1V1FZXRAeEGJqBAsQCBAAAgIBAgMCBRAeEGJqBAYQCBAHHAISGmVbXFZdRUESfGYSAwIcAgkSZVtcBAYJEkoEBhsSc0JCXldlV1B5W0YdBwEFHAEEEhp5emZ/fh4SXltZVxJ1V1FZXRsScVpAXV9XHQsDHAIcBgYFABwDAAYSYVNUU0BbHQcBBRwBBBAeEGJqBAcQCBB8V0ZBUVNCVxAeEGJqBAQQCBB/XUhbXl5TEB4QYmoDAwYGEAhGQEdXHhBiagMDBwAQCAMCHhBiagMDBwEQCAcCHhBiagMDBwYQCFRTXkFXHhBiagMDBwcQCBAGVRAeEGJqBAIQCEZAR1ceEGJqCgUQCEZAR1ceEGJqCgADEAgGAAsGBQIHAwcAHhBiagoAABAIAQAGBgsEAAoeEGJqCgABEAgABwUBAgUGCh4QYmoDBgUQCFRTXkFXHhBiagMHBxAIEHRAWxJ4R14SAgsSAAIAAxIAAQgHCwgHBxJ1f2YZAgECAhIaf11BUV1FEmFGU1xWU0BWEmZbX1cbEB4QYmoAAQQQCFRTXkFXHhBiagMLBhAIVFNeQVceEGJqAwsHEAhGQEdXHhBiagABBRAIAh4QYmoAAQoQCBBfW0FBW1xVEB4QYmoAAgoQCBBEW0FbUF5XEB4QYmoAAwoQCAIeEGJqAAEDEAgKAAYeEGJqAAEAEAgDBwEEHhBiagAHBhAIVFNeQVceEGJqAAsHEAhUU15BVx4QYmoABAoQCFRTXkFXHhBiagMEBBAIRkBHVx4QYmoDAQoQCEZAR1ceEGJqAwYBEAhGQEdXHhBiagMDBgAQCAAAHhBiagMDBgEQCAABHhBiagMDBgQQCAIeEGJqAwMGBRAIBh4QYmoFAwYQCBAEBgcHBFEFBRAeEGJqBQMHEAgQEB4QYmoFAAYQCBADAgACBVAAVBAeEGJqBQAHEAgQAwIAAgVQAFQQHhBiagUACxAIEAsCVwQHBgQHEB4QYmoGBgEQCEZAR1ceEGJqBgQEEAhGQEdXHhBiagYEBRAIRkBHVx4QYmoGBAoQCEZAR1ceEGJqAwsDEAgCHhBiagsGEAgDHhBiagMAAhAIaW8eEGJqAwYDEAhUU15BVx4QYmoLBBAIEFpGRkJBCB0dRUVFHEFbX1teU0BFV1AcUV1fHRAeEGJqBwcQCBBaRkZCQRcBcxcAdBcAdFFaQF1fVxxVXV1VXlccUV1fFwB0EB4QYmoBBhAIEHdAQF1AblwSEhISU0YSfVcSGlpGRkJBCB0dRUVFHEFbX1teU0BFV1AcUV1fHVloA1N7SGdiHVtcW0YcWEEIAQgDAgUGBhtuXBISEhJTRhJLVxIaWkZGQkEIHR1FRUUcQVtfW15TQEVXUBxRXV8dWWgDU3tIZ2IdW1xbRhxYQQgBCAMFBwIbEB4QYmoDAgQHEAgAHhBiagoHAhAIAx4QYmoKBwMQCAEKBAYeEGJqAwIHBhAIAwQABwoEBgELBwcCAB4QYmoDAgIKEAgBBAICHhBiagMCBwcQCAMEAAcKBAYBCwcDAAQeEGJqAwIHBBAIAwQABwoEBgELBQADAR4QYmoDAgEKEAgQC1FQUwBRAwIfVwJUCh8DA1dQHwsEV1AfVgcAV1RRAFYKC1AEEB4QYmoBBQMQCEZAR1dPTx5JEEYQCBBiagALBRAeEFYQCEkQYmoBChAIEF9dR0FXX11EVxAeEGJqBQIQCAQKBR4QYmoDBwUQCBBGQEdXEB4QYmoFABAIEGF3cWZ7fXwIXEZaH1FaW15WGgMbDHZ7ZAhcRlofUVpbXlYaABsMdntkCFxGWh9RWlteVhoDGxAeEGJqAQYQCBBmS0JXd0BAXUAIEnFTXFxdRhJAV1NWEkJAXUJXQEZLEhUCFRJdVBJcR15eblwSEhISU0YScEYSGlpGRkJBCB0dRUVFHEFbX1teU0BFV1AcUV1fHVloA1N7SGdiHVtcW0YcWEEIAAgDBgQFChtuXBISEhJTRhJ6Zn9 cF1WS3deV19XXEYcd0ASGlpGRkJBCB0dRUVFHEFbX1teU0BFV1AcUV1fHVloA1N7SGdiHVtcW0YcWEEIAQgDBQQHAhsQHhBiagUKEAgFAQceEGJqBQsQCAMHCx4QYmoKBwIQCAAeEGJqCgcDEAgGAgcKHhBiagMCBwQQCAMEAAcKBAYBCwUAAwYeEGJqAwIBChAIEAtRUFMAUQMCH1cCVAofAwNXUB8LBFdQH1YHAFdUUQBWCgtQBBAeEGJqAQUDEAhGQEdXT09v
              appId: PXkZ1aIzUP
              tag: v6.7.9
              uuid: 9cba2c10-e0f8-11eb-96eb-d52efc2d89b6
              ft: '221'
              seq: '2'
              en: NTA
              cs: 0b3c33b2d46159a77ece009a001aba347499768e144dfd4ce0a667839f852a1f
              pc: '5381249559291819'
              sid: "9dc50c60-e0f8-11eb-80c2-39fcff295c8bó\_\x84±ó\_\x84¶ó\_\x84²ó\_\x84µó\_\x84¸ó\_\x84¶ó\_\x84´ó\_\x84³ó\_\x84¹ó\_\x84¶ó\_\x84¸ó\_\x84µó\_\x84³"
              vid: 9dc4f6b4-e0f8-11eb-9ff8-0242ac120012
              cts: 9dc53370-e0f8-11eb-80c2-39fcff295c8b
              rsc: '2'
          - url: 'https://trc-events.taboola.com/1152616/log/3/unip'
            method: GET
            label: 'https://trc-events.taboola.com/1152616/log/3/unip'
            headers:
              Accept: '*/*'
            body:
              en: pre_d_eng_tb
              tos: '2040'
              scd: '13'
              ssd: '1'
              est: '1625864395193'
              ver: '32'
              isls: 'true'
              src: i
              invt: '1500'
              tim: '1625864397233'
              vi: '1625864395184'
              ri: 855bbb3cfa586393ab9021e79d682e9f
              sd: v2_f9281b96955730f1773ae140ee101969_e04eb5d6-2598-44c9-86f7-58862c73a7f5-tuct7e23e4c_1625864396_1625864396_CKj60AIQ6KxGGLCzx-ioLyABKAEwuQE4yesMQKKaEEjF2tgDULufJ1gAYABoqtT02YSY-IJs
              ui: e04eb5d6-2598-44c9-86f7-58862c73a7f5-tuct7e23e4c
              ref: 'https://chrome.google.com/'
              cv: 20210615-3-RELEASE
              item-url: 'https://www.similarweb.com/'
          - url: 'https://api-iam.intercom.io/messenger/web/ping'
            method: POST
            label: 'https://api-iam.intercom.io/messenger/web/ping'
            headers:
              Content-Type: application/x-www-form-urlencoded
              Accept: '*/*'
            body:
              Idempotency-Key: cf40cc7bcadb27b7
              app_id: e74067abd037cecbecb0662854f02aee12139f95
              g: 745bb9d77e113987e17cb1a4668f49b3d60d7923
              internal: '{}'
              page_title: 'Website Traffic - Check and Analyze Any Website | Similarweb'
              platform: web
              r: 'https://chrome.google.com/'
              referer: 'https://www.similarweb.com/'
              s: 8f2d6298-ca99-4d98-9502-aeb6c9863c50
              sampling: 'false'
              source: apiBoot
              user_active_company_id: undefined
              user_data: '{}'
              v: '3'
          - url: 'https://workers-203821.appspot.com/geo/api/v1.0/getJSON'
            method: GET
            label: 'https://workers-203821.appspot.com/geo/api/v1.0/getJSON'
            headers:
              Accept: '*/*'
            body:
              getgeoids: ''
          - url: 'https://workers-203821.appspot.com/geo/api/v1.0/getJSON'
            method: GET
            label: 'https://workers-203821.appspot.com/geo/api/v1.0/getJSON'
            headers:
              Accept: '*/*'
            body:
              getgeoids: ''
          - url: 'https://sleeknotestaticcontent.sleeknote.com/editorv2/desktoptoggler/67f3d86a-91c7-43b8-bb16-8517bd08391d.html'
            method: GET
            label: 'https://sleeknotestaticcontent.sleeknote.com/editorv2/desktoptoggler/67f3d86a-91c7-43b8-bb16-8517bd08391d.html'
            headers:
              Accept: '*/*'
            body:
              '1625864397992': ''
          - url: 'https://sleeknotestaticcontent.sleeknote.com/editorv2/desktoptoggler/6dd24083-ac43-4e00-987e-6bed619e7378.html'
            method: GET
            label: 'https://sleeknotestaticcontent.sleeknote.com/editorv2/desktoptoggler/6dd24083-ac43-4e00-987e-6bed619e7378.html'
            headers:
              Accept: '*/*'
            body:
              '1625864397992': ''
          - url: 'https://sleeknotestaticcontent.sleeknote.com/editorv2/desktoptoggler/bda12cfe-2074-4feb-a553-f147cc60a0ad.html'
            method: GET
            label: 'https://sleeknotestaticcontent.sleeknote.com/editorv2/desktoptoggler/bda12cfe-2074-4feb-a553-f147cc60a0ad.html'
            headers:
              Accept: '*/*'
            body:
              '1625864397992': ''
          - url: 'https://sleeknotestaticcontent.sleeknote.com/editorv2/desktoptoggler/c74bb2b5-0795-4fc8-ab65-db8a91a1cdf2.html'
            method: GET
            label: 'https://sleeknotestaticcontent.sleeknote.com/editorv2/desktoptoggler/c74bb2b5-0795-4fc8-ab65-db8a91a1cdf2.html'
            headers:
              Accept: '*/*'
            body:
              '1625864397992': ''
          - url: 'https://sleeknotestaticcontent.sleeknote.com/editorv2/desktoptoggler/12bb7e53-0510-4cae-a596-30dae2865f48.html'
            method: GET
            label: 'https://sleeknotestaticcontent.sleeknote.com/editorv2/desktoptoggler/12bb7e53-0510-4cae-a596-30dae2865f48.html'
            headers:
              Accept: '*/*'
            body:
              '1625864397992': ''
          - url: 'https://sleeknotestaticcontent.sleeknote.com/editorv2/desktoptoggler/415c0342-12d5-4824-94b6-09f6d5bde3b4.html'
            method: GET
            label: 'https://sleeknotestaticcontent.sleeknote.com/editorv2/desktoptoggler/415c0342-12d5-4824-94b6-09f6d5bde3b4.html'
            headers:
              Accept: '*/*'
            body:
              '1625864397992': ''
          - url: 'https://sleeknotestaticcontent.sleeknote.com/editorv2/desktoptoggler/92ea50d4-7217-4039-b01c-e0b7e51a5bc4.html'
            method: GET
            label: 'https://sleeknotestaticcontent.sleeknote.com/editorv2/desktoptoggler/92ea50d4-7217-4039-b01c-e0b7e51a5bc4.html'
            headers:
              Accept: '*/*'
            body:
              '1625864397992': ''
          - url: 'https://collector-pxkz1aizup.px-cloud.net/api/v2/collector'
            method: POST
            label: 'https://collector-pxkz1aizup.px-cloud.net/api/v2/collector'
            headers:
              Content-type: application/x-www-form-urlencoded
              Accept: '*/*'
            body:
              payload: aUkQRhAIEGJqAAMQHhBWEAhJEGJqBwUQCBBpbhBmS0JXd0BAXUAIEnFTXFxdRhJAV1NWEkJAXUJXQEZLEhUCFRJdVBJcR15eElNGEnBGElNGEnpmf352XVFHX1dcRhxVV0Z3XldfV1xGcEt7VhJTRhIOU1xdXEtfXUdBDAgACAMEAhJTRhJzQEBTSxxUXUB3U1FaElNGElNWVnVRXltWEm4QHm4QZktCV3dAQF1ACBJxU1xcXUYSQFdTVhJCQF1CV0BGSxIVAhUSXVQSXEdeXhJTRhJwRhJTRhJ6Zn9 dl1RR19XXEYcVVdGd15XX1dcRnBLe1YSU0YSDlNcXVxLX11HQQwIAAgDBAISU0YSc0BAU0scVF1Ad1NRWhJTRhJTVlZ1UV5bVhJuEG8QHhBiagoHAhAIAR4QYmoKBwMQCAcGCgMeEGJqAwIHBBAIAwQABwoEBgELCgMCAh4QYmoDAgEKEAgQC1FQUwBRAwIfVwJUCh8DA1dQHwsEV1AfVgcAV1RRAFYKC1AEEB4QYmoBBQMQCEZAR1ceEGJqCwQQCBBaRkZCQQgdHUVFRRxBW19bXlNARVdQHFFdXx0QT08eSRBGEAgQYmoAAxAeEFYQCEkQYmoHBRAIEGluEGZLQld3QEBdQAgScVNcXF1GEkBXU1YSQkBdQldARksSFQIVEl1UElxHXl4SU0YScEYSU0YSemZ/fnZdUUdfV1xGHFVXRndeV19XXEZwS3tWElNGElxXRRJoHFRcHFtcW0YSU0YSaBJTRhJaRkZCQQgdHVFWXBxCR0FaUUBXRRxRXV8dWEEdUwNWVgZXC1cDAAIEBAYHVFQHAlEDAQEEVwQDAQsBAgccWEEIBQsIBwEEBRJTRhJ9UFhXUUYcDlNcXVxLX11HQQwSU0YSfVBYV1FGHA5TXF1cS19dR0EMElNGEl4SU0YSfVBYV1FGHFNWVhJTRhJzQEBTSxwOU1xdXEtfXUdBDBJuEB5uEGZLQld3QEBdQAgScVNcXF1GEkBXU1YSQkBdQldARksSFQIVEl1UElxHXl4SU0YScEYSU0YSemZ/fnZdUUdfV1xGHENHV0BLYVdeV1FGXUASU0YSWkZGQkEIHR1YQRxbXEZXQFFdX1FWXBxRXV8dVEBTX1cfX11WV0BcHFcAA1ACVFQHHFhBCAMIAwEACgoHElNGElESU0YSRxJTRhJ9UFhXUUYcDlNcXVxLX11HQQwSU0YSXRJTRhJ9UFhXUUYcDlNcXVxLX11HQQwSU0YSXRJTRhJ9UFhXUUYcDlNcXVxLX11HQQwSbhBvEB4QYmoKBwIQCAYeEGJqCgcDEAgEAgEEHhBiagMCBwQQCAMEAAcKBAYBCwoDAgIeEGJqAwIBChAIEAtRUFMAUQMCH1cCVAofAwNXUB8LBFdQH1YHAFdUUQBWCgtQBBAeEGJqAQUDEAhGQEdXT09v
              appId: PXkZ1aIzUP
              tag: v6.7.9
              uuid: 9cba2c10-e0f8-11eb-96eb-d52efc2d89b6
              ft: '221'
              seq: '3'
              en: NTA
              cs: 0b3c33b2d46159a77ece009a001aba347499768e144dfd4ce0a667839f852a1f
              pc: '7502933761077201'
              sid: "9dc50c60-e0f8-11eb-80c2-39fcff295c8bó\_\x84±ó\_\x84¶ó\_\x84²ó\_\x84µó\_\x84¸ó\_\x84¶ó\_\x84´ó\_\x84³ó\_\x84¹ó\_\x84¶ó\_\x84¸ó\_\x84µó\_\x84³"
              vid: 9dc4f6b4-e0f8-11eb-9ff8-0242ac120012
              cts: 9dc53370-e0f8-11eb-80c2-39fcff295c8b
              rsc: '3'
          - url: 'https://sleeknotestaticcontent.sleeknote.com/c/sleeknote4.css'
            method: GET
            label: 'https://sleeknotestaticcontent.sleeknote.com/c/sleeknote4.css'
            headers:
              Accept: '*/*'
            body:
              '1625864397992': ''
          - url: 'https://sleeknotestaticcontent.sleeknote.com/template-images/123456_close_button.png'
            method: GET
            label: 'https://sleeknotestaticcontent.sleeknote.com/template-images/123456_close_button.png'
            headers:
              Accept: '*/*'
            body:
              '1625864397992': ''
          - url: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true,w-544/637580486296294469.png'
            method: GET
            label: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true,w-544/637580486296294469.png'
            headers:
              Accept: '*/*'
          - url: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true/637577103847888702.png'
            method: GET
            label: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true/637577103847888702.png'
            headers:
              Accept: '*/*'
          - url: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true/637465553967473101.png'
            method: GET
            label: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true/637465553967473101.png'
            headers:
              Accept: '*/*'
          - url: 'https://fonts.googleapis.com/css'
            method: GET
            label: 'https://fonts.googleapis.com/css'
            headers:
              Accept: '*/*'
            body:
              family: 'Roboto:400,300,700'
              '1625864397992': ''
          - url: 'https://fonts.googleapis.com/css'
            method: GET
            label: 'https://fonts.googleapis.com/css'
            headers:
              Accept: '*/*'
            body:
              family: 'Lato:300,400,700'
              '1625864397992': ''
          - url: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true,w-514/637577215433659291.png'
            method: GET
            label: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true,w-514/637577215433659291.png'
            headers:
              Accept: '*/*'
          - url: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true,w-514/637580486543018030.png'
            method: GET
            label: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true,w-514/637580486543018030.png'
            headers:
              Accept: '*/*'
          - url: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true/637465694734941516.png'
            method: GET
            label: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true/637465694734941516.png'
            headers:
              Accept: '*/*'
          - url: 'https://twemoji.maxcdn.com/v/12.1.3/72x72/1f389.png'
            method: GET
            label: 'https://twemoji.maxcdn.com/v/12.1.3/72x72/1f389.png'
            headers:
              Accept: '*/*'
            body:
              '1625864397992': ''
          - url: 'https://twemoji.maxcdn.com/v/12.1.3/72x72/1f4e5.png'
            method: GET
            label: 'https://twemoji.maxcdn.com/v/12.1.3/72x72/1f4e5.png'
            headers:
              Accept: '*/*'
            body:
              '1625864397992': ''
          - url: 'https://trc-events.taboola.com/1152616/log/3/unip'
            method: GET
            label: 'https://trc-events.taboola.com/1152616/log/3/unip'
            headers:
              Accept: '*/*'
            body:
              en: pre_d_eng_tb
              tos: '5297'
              scd: '13'
              ssd: '1'
              est: '1625864395193'
              ver: '32'
              isls: 'true'
              src: i
              invt: '3000'
              tim: '1625864400491'
              vi: '1625864395184'
              ri: 855bbb3cfa586393ab9021e79d682e9f
              sd: v2_f9281b96955730f1773ae140ee101969_e04eb5d6-2598-44c9-86f7-58862c73a7f5-tuct7e23e4c_1625864396_1625864396_CKj60AIQ6KxGGLCzx-ioLyABKAEwuQE4yesMQKKaEEjF2tgDULufJ1gAYABoqtT02YSY-IJs
              ui: e04eb5d6-2598-44c9-86f7-58862c73a7f5-tuct7e23e4c
              ref: 'https://chrome.google.com/'
              cv: 20210615-3-RELEASE
              item-url: 'https://www.similarweb.com/'
          - url: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true/637465706518977724.png'
            method: GET
            label: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true/637465706518977724.png'
            headers:
              Accept: '*/*'
          - url: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true,w-370/637579686231705510.png'
            method: GET
            label: 'https://images.sleeknote.com/sleeknoteimages/tr:f-png,lo-true,w-370/637579686231705510.png'
            headers:
              Accept: '*/*'
          - url: 'https://trc-events.taboola.com/1152616/log/3/unip'
            method: GET
            label: 'https://trc-events.taboola.com/1152616/log/3/unip'
            headers:
              Accept: '*/*'
            body:
              en: pre_d_eng_tb
              tos: '11300'
              scd: '13'
              ssd: '1'
              est: '1625864395193'
              ver: '32'
              isls: 'true'
              src: i
              invt: '6000'
              tim: '1625864406494'
              vi: '1625864395184'
              ri: 855bbb3cfa586393ab9021e79d682e9f
              sd: v2_f9281b96955730f1773ae140ee101969_e04eb5d6-2598-44c9-86f7-58862c73a7f5-tuct7e23e4c_1625864396_1625864396_CKj60AIQ6KxGGLCzx-ioLyABKAEwuQE4yesMQKKaEEjF2tgDULufJ1gAYABoqtT02YSY-IJs
              ui: e04eb5d6-2598-44c9-86f7-58862c73a7f5-tuct7e23e4c
              ref: 'https://chrome.google.com/'
              cv: 20210615-3-RELEASE
              item-url: 'https://www.similarweb.com/'